TEST_CASE/All/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    overset2
    {
        type            overset;
    }

    overset3
    {
        type            overset;
    }

    walls
    {
type            zeroGradient;
	/*type fixedValue;
	value uniform 0;*/
  }

    hole
    {
      type            zeroGradient;
	/*type fixedValue;
	value uniform 0;*/
    }

    body
    {
      type            zeroGradient;
	/*type fixedValue;
	value uniform 0;*/
    }
}

// ************************************************************************* //
