TEST_CASE/All/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    overset2
    {
        type            overset;
    }

    overset3
    {
        type            overset;
    }

    walls
    {
	type zeroGradient;
  }

    hole
    {
	type nutkWallFunction; 
	value uniform 0;
     }

    body
    {
	type nutkWallFunction; 
	value uniform 0;
     }
}

// ************************************************************************* //
