TEST_CASE/All/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
{
    type        forces;

    libs ( "libforces.so" );

    //writeControl   timeStep;
    //timeInterval    1;

    log         yes;

    patches     (hole);
    rho         rhoInf;     // Indicates incompressible
    log         true;
    rhoInf      1.2;          // Redundant for incompressible

    CofR        (0 0 0);    // Rotation around centre line of propeller
    pitchAxis   (0 1 0);
}

forces2
{
    type          forces;

    libs ( "libforces.so" );

    //writeControl  timeStep;
    //timeInterval  1;

    log           yes;

    patches       (body);
    rho           rhoInf;     // Indicates incompressible
    log           true;
    rhoInf        1.2;          // Redundant for incompressible

    CofR          (0 0 0);    // Rotation around centre line of propeller
    pitchAxis     (0 1 0);
}


// ************************************************************************* //
